packages/StoveOpt/StoveOpt-0.3.7.tar.gz/StoveOpt-0.3.7/StoveOpt/foamfiles/counterFlowFlame2D/case_100/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     reactingFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          1e-3;

writeControl    adjustableRunTime;

writeInterval   0.5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.4;

functions
{
    probes
    {
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );

        type            probes;

        // Name of the directory for probe data
        name            probes;

        // Write at same frequency as fields
        outputControl   outputTime;
        outputInterval  1;

        // Fields to be probed
        fields
        (
            T   //-Fields you want to see

        );

        probeLocations
        (
    (0.0 -0.07 0.5)
            (0.0 -0.04 0.5)
            (0.0 -0.07 0.3)
            (0 -0.07 0.33)
            (0 -0.04 0.3)
            (0.0 -0.04 0.33)
            (0 0.0 0.33)
            (0.0 0.0 0.3)
            (0 0.1 0.33)
            (0.0 0.1 0.3)
            (0 0.14 0.3)
            (0.0 0.14 0.33)
            (0.0 0.17 0.3)
            (0 0.17 0.33)
            (0.0 0.14 0.5)
            (0.0 0.14 0.33)

);